Tekla Open API Reference for Tekla Structures 2025
RebarItem.Select Method (String, Double, String, Boolean)
 Selects the rebar item in the rebar database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string Grade,
	double Diameter,
	string Usage,
	bool UseNominalDiameter
)
Public Function Select (
	Grade As String,
	Diameter As Double,
	Usage As String,
	UseNominalDiameter As Boolean
) As Boolean
Parameters
Grade
Type: System.String
The grade of the rebar item to select.
Diameter
Type: System.Double
The diameter of the rebar item to select.
Usage
Type: System.String
The usage of the rebar item to select.
UseNominalDiameter
Type: System.Boolean
 If set to false, the item is selected based on the actual diameter. If true, the item is selected based on the nominal diameter.
Return Value
Type: Boolean
True on success.
See Also
Reference
RebarItem Class
Select Overload
Tekla.Structures.Catalogs Namespace